<?php
// 星座ごとの占い結果を格納
$fortune = array(
    "おひつじ座♈︎" => "<h3>⭐️総合運⭐️</h3>
                    <p>
                    1年を通してパワフルなエネルギーに満ち溢れる2024年。<br>
                    特に新しく挑戦したいものがある場合は、3月までにトライして。<br>
                    4月にいったん見直し、そこで少し軌道修正をするとそれ以降もスムーズに進みそう。<br>
                    6月以降はさらにフットワーク軽く動けるようになるので、それまでにやりたいことには着手しておくと吉。<br>
                    いつものエネルギッシュさはそのままで、時にはクールダウンしながら、<br>
                    新しいステージに向かう貴重な1年となるでしょう。<br><br>
                    </p>
                    <h3>🩷恋愛運🩷</h3>
                    <p>
                    2024年の恋はアクティブ！<br>
                    初めて会ったのに電撃的な恋に落ちるなど、いつでも恋に前向きになれるでしょう。<br>
                    後半は出会いのチャンスも多いので、何があっても動けるように心の準備を。<br>
                    実直な方とのご縁が待っていそう。<br><br>
                    </p>
                    <h3>💻仕事運💻</h3>
                    <p>
                    チャンス到来! 新しいプロジェクトに参加するなど、チャレンジする機会が増え、活躍のシーンで目立てます。<br>
                    やったことがない仕事でも「楽しそう！」と思ったら、即挑戦を。<br>
                    前向きなあなたの姿は周囲からも認められるでしょう。<br><br>
                    </p>",

    "牡牛座♉︎" => "<h3>⭐️総合運⭐️</h3>
                <p>
                活動の場を広げられる2024年。<br>
                幸運の星・木星が牡牛座にいる5月までにやったことは、<br>
                この先の長きにわたる幸運にもつながるので、積極的にトライを。<br>
                自分のペースを守りつつ、将来のことをきちんと考えて行動することが、運気アップにつながります。<br>
                人間関係も改善され、自分のことをわかってくれる人が周囲に集まってくるようになりそうです。<br>
                人と関わることがこの上ない喜びとなる、楽しい1年になるでしょう。<br><br>
                </p>
                <h3>🩷恋愛運🩷</h3>
                <p>
                新たな恋のチャンス! 焦らず、少しずつ距離を縮めるのがポイントです。<br>
                恋人のいる人は、現実的な未来についての話し合いが進みそう。<br>
                雰囲気よりも味重視のレストランデートが吉。<br>
                相手に対する信頼と安定感を感じる、幸せな一年でしょう。<br><br>
                </p>
                <h3>💻仕事運💻</h3>
                <p>
                仕事の上で、あなたらしさを発揮できるシーンがたびたびあるでしょう。<br>
                自分のリズムで業務が進められ、達成感を味わうことも。<br>
                収入アップの転職は、5月までに検討を。<br>
                今までやったことがない業種でも、興味があればぜひ応募して。<br><br>
                </p>",

    "双子座♊︎" => "<h3>⭐️総合運⭐️</h3>
                <p>
                12年に1度のラッキーイヤーの到来です! <br>
                特に6月以降は持ち前の明るさを活かし、人気運も上昇します。<br>
                フットワークの良を発揮して、いつも人の輪の中心にいることにも。<br>
                周囲から頼られ、信頼される喜びを感じるシーンもありそうです。<br>
                2024年の経験はこの先のあなたの人生を彩る大切な土台になるので、ぜひ様々なことに挑戦して。<br>
                9月頃に一度クールダウンするかもしれませんが、<br>
                年末から来年にかけて、明るく楽しい時間を過ごせるでしょう。<br><br>
                </p>
                <h3>🩷恋愛運🩷</h3>
                <p>
                出会い運アップ! オープンで率直なコミュニケーションが、あなたの魅力を輝かせます。<br>
                こまめに連絡を取ることが、関係性を深めそう。<br>
                恋と仕事など、他の物事とのバランスも取れて、両方を楽しめる1年を過ごせるでしょう。<br><br>
                </p>
                <h3>💻仕事運💻</h3>
                <p>
                楽しい一方で、変化の多い1年です。<br>
                仕事で必要な新しいスキルや知識を積極的に学ぶことを意識して過ごすと、<br>
                キャリアアップにもつながるでしょう。<br>
                仕事先の仲間との関係も良好で、価値のある人脈を築けそうです。<br><br>
                </p>",

    "蟹座♋︎" => "<h3>⭐️総合運⭐️</h3>
                <p>
                深い人間関係を築ける1年です。<br>
                思いやりと信頼をもって人に接することができるので、<br>
                大切な人との関係がより深まる年になるでしょう。<br>
                7月の蟹座の新月の頃には、大きな決断をするかもしれません。<br>
                あなたの深い愛情と直感力に従えば、間違った選択はしないので大丈夫です。<br>
                人への感謝を忘れず、サポートしてくれた恩を気持ちで返すことを心がけましょう。<br>
                年の後半は新しい趣味などの楽しみを見つけることで、来年の喜びにつなげられそう。<br><br>
                </p>
                <h3>🩷恋愛運🩷</h3>
                <p>
                思いやりと愛情にあふれる2024年。改めて恋する喜びを感じる場面がありそうです。<br>
                派手なアクティビティより、お家デートでまったりするほうが、より愛を深めることになるでしょう。<br>
                迷った時は月を眺めると、心が落ち着きます。<br><br>
                </p>
                <h3>💻仕事運💻</h3>
                <p>
                今までの頑張りが認められ、仕事の幅が広がります。<br>
                あなたの協調性が組織の要となり、頼られる場面も多くなりそう。<br>
                一方でワークライフバランスが取りやすくなる時期でもあるので、家庭との両立もスムーズにできるでしょう。<br><br>
    </p>",

    "獅子座♌︎" => "<h3>⭐️総合運⭐️</h3>
                <p>
                のびのびと自分らしく過ごせる1年です。<br>
                5月頃は未知の世界に挑戦する意欲によって、今まで見たこともない新たな自分の姿を発見できそう。<br>
                心温かな人と人との交流が、あなたをさらに成長させてくれるでしょう。<br>
                自分の考えを積極的に発信することで、それに賛同してくれる人の輪があなたの周りにできそうです。<br>
                いつも以上にフットワーク良く動けるので行動範囲も広がり、新しい世界に挑戦することも可能でしょう。<br><br>
                </p>
                <h3>🩷恋愛運🩷</h3>
                <p>
                恋のサプライズがありそうです。<br>
                嬉しい言葉や思わぬプレゼントなど、楽しいことが待っていそう。<br>
                ロマンチックな恋も楽しめて、思い出深い年になるでしょう。<br>
                秋以降は現実的に未来を考えられるようになり、次のステップへ前進する可能性も。<br><br>
                </p>
                <h3>💻仕事運💻</h3>
                <p>
                リーダーシップを発揮できる年です。<br>
                あなたが思い描くゴールに向け、チームプレイを発揮することで、<br>
                大きな成果を上げられるでしょう。<br>
                昇進やキャリアアップを目指すなら、11月以降のアクションがおすすめです。<br><br>
                </p>",

    "乙女座♍︎" => "<h3>⭐️総合運⭐️</h3>
                <p>
                人に恵まれる1年です。あなたが苦手としていることに、そっと助けの手を差し伸べてくれる人が登場しそう。<br>
                受けたご恩をお返ししようとするスタンスが、さらなる幸運を呼ぶでしょう。<br>
                9月上旬の新月をきっかけに、大きくステップアップする兆しがあります。<br>
                今まで頑張って取り組んできたことを形にできて、達成感を味わえそう。<br>
                自分のペースを守りながらひとつずつ積み上げていく姿勢が、来年のさらなる飛躍につながるでしょう。<br><br>
                </p>
                <h3>🩷恋愛運🩷</h3>
                <p>
                1年を通して誠実な恋愛ができるでしょう。<br>
                ただし、6月上旬の恋はインパクトがあり、一生の思い出になりそう。<br>
                多少のアップダウンがあっても、10月以降は次第に落ち着いて、恋を楽しめるようになるようです。<br><br>
                </p>
                <h3>💻仕事運💻</h3>
                <p>
                細やかな計画性が評価され、プロジェクトリーダーなどに抜擢される可能性あり。<br>
                あなたの細やかな気遣いが喜ばれ、人から頼られる場面も多そうです。<br>
                肩の力を抜き、あなたらしく振る舞うことが組織全体のメリットになるでしょう。<br><br>
                </p>",

    "天秤座♎︎" => "<h3>⭐️総合運⭐️</h3>
                <p>
                自分のやりたいことができる2024年。<br>
                長年温めたきた計画に着手し、新しい世界に挑戦できるでしょう。<br>
                人の意見に振り回されることなく、<br>
                とにかく自分が心の底からやりたいことは何かを考えて、トライする姿勢が大事です。<br>
                10月上旬には新しいステージに駆け上がることができそう。<br>
                この1年は人の輪の中心にいる場面も多くなり、注目されるシーンも増えるでしょう。<br>
                必要以上に気負うことなく、あなたが考えるやり方で周囲をまとめて吉です。<br><br>
                </p>
                <h3>🩷恋愛運🩷</h3>
                <p>
                全てをゆだねられる、理想的な相手との出会いがありそうです。<br>
                あまり躊躇せず、直感を信じてOK！<br>
                カップルはお互いに歩み寄ることの大切さを実感する出来事がありそう。<br>
                その経験によって、心の底から理解しあえる真のパートナーとなるでしょう。<br><br>
                </p>
                <h3>💻仕事運💻</h3>
                <p>
                チームへの貢献が、あなたの魅力を輝かせます。<br>
                適切な立ち位置で仕事を進めていく柔軟性が、改めて評価される場面がありそう。<br>
                10月以降は昇進や転職といった、キャリアのステップアップを迎えるかもしれません。<br><br>
                </p>",

    "蠍座♏︎" => "<h3>⭐️総合運⭐️</h3>
                <p>
                人間関係にフォーカスが当たる1年です。<br>
                今までの良好な交友関係がキープされ、あなたの人柄の良が最大限に活かせる機会がとても多いよう。<br>
                一方で大きな決断をする場面もあり、4月に新しい世界に一歩踏み出す出来事も。<br>
                あなたを援助してくれる人にも恵まれるので、焦らずに自分のペースで確実に前進すると良いでしょう。<br>
                人のサポートを得ながら新たな道を探究することで、よりあなたらしく自由に振る舞えるようになるはずです。<br><br>
                </p>
                <h3>🩷恋愛運🩷</h3>
                <p>
                モテ期の1年! あなたの魅力が開花し、異性からのアプローチが続きます。<br>
                その全てを受け入れる必要はなく、恋の主導者として取捨選択をしましょう。<br>
                「断ると相手に申し訳ない」などと思わず、あなたの気持ちを優先にして。<br><br>
                </p>
                <h3>💻仕事運💻</h3>
                <p>
                全体的に好調な年です。仕事で何か困ったことが起きても、助けてくれる人がすぐに現れるでしょう。<br>
                人への感謝をまた仕事でお返しすることで、ポジティブなエネルギーが循環します。<br>
                前に進むことを恐れず、チャレンジを。<br><br>
                </p>",

    "射手座♐︎" => "<h3>⭐️総合運⭐️</h3>
                <p>
                何をするのにも順風満帆な年です。<br>
                これまで苦労してきたことが報われ、ほっと一息つける1年になりそう。<br>
                昨年までのチャレンジが実を結び、喜びを味わう場面も多いでしょう。<br>
                5月下旬にひとつの区切りとなる出来事があり、また新たな目標に向かって頑張ることになるかもしれません。<br>
                知的好奇心を全開にしてフットワーク軽く動くことが、最終的な幸運につながるでしょう。<br>
                向上心にあふれ、年末にはさらに新しい世界へ羽ばたく準備ができそうです。<br><br>
                </p>
                <h3>🩷恋愛運🩷</h3>
                <p>
                追うよりも、追われる恋が多くなるでしょう。<br>
                楽しい駆け引きもありそうですが、あまり戦略的にならないようにして。<br>
                カップルは未来に向けて一歩前進するかもしれません。<br>
                お互いの理想をとことん語り合うことが、幸運の秘訣です。<br><br>
                </p>
                <h3>💻仕事運💻</h3>
                <p>
                コツコツと一人で進めていたことが、花開く年です。<br>
                あなた独自のアイデアが認められ、一目置かれる存在に。<br>
                業務改善にも役立ち、周囲から感謝されるでしょう。<br>
                過去に固執しない大胆な発想と行動力が、新しい世界を広げることに。<br><br>
                </p>",

    "山羊座♑︎" => "<h3>⭐️総合運⭐️</h3>
                <p>
                成果を上げながら、じっくりと自分のペースで進んでいける2024年。<br>
                慎重さと大胆さを兼ね備えながら、様々な物事を力強くこなせるでしょう。<br>
                年の前半は新しいことにチャレンジするというより、<br>
                それまでやってきたことの進捗を確認する期間に向いています。<br>
                11月の大きな転換期を迎える前に、自分のやるべきことは何か、<br>
                そこに何をプラスすればよりブラッシュアップできるのかを整理しておくと良いでしょう。<br><br>
                </p>
                <h3>🩷恋愛運🩷</h3>
                <p>
                将来を見据えた、真剣な恋にご縁がありそうです。<br>
                恋のスタート時はなかなか進展しないかもしれませんが、一度火がつくとあっという間に本気度UP！<br>
                秋以降の急展開もありそうです。<br>
                パートナーがいる方は、より愛を深められる1年に。<br><br>
                </p>
                <h3>💻仕事運💻</h3>
                <p>
                キャリアアップのチャンス! 年の前半にコツコツと地道に積み重ねた物事が、後半に花開きそう。<br>
                特に11月以降は、それまでの計画的なアクションが功を奏します。<br>
                年末にかけて成功に向け、一気に駆け登っていけるでしょう。<br><br>
                </p>",

    "水瓶座♒︎" => "<h3>⭐️総合運⭐️</h3>
                <p>
                パワーみなぎる1年! 「いつかやってみたい」と後回しにしていた物事への挑戦に最適な年です。<br>
                後押ししてくれる人にも恵まれ、感謝の念を抱く場面も。<br>
                チャレンジすることで、この先に広がる新たな可能性に気づけたり、<br>
                今後進むべき道まで見えてくるかもしれません。<br>
                11月に起きる出来事は、大きな意識改革や人生の方向転換につながりそう。<br>
                発想の転換と臨機応変な行動力でパワフルに乗り越えていくと、<br>
                年末にはその先の確かな未来が見えてくるでしょう。 <br>
                喜びに満ち溢れる2024年。<br><br>
                </p>
                <h3>🩷恋愛運🩷</h3>
                <p>
                無理だと思っていた人からアプローチされたり、想定外の人から告白されたりと嬉しいサプライズも。<br>
                目の前にある幸せは、遠慮せずに受け取ることが大事です。<br>
                愛し、愛される喜びに浸れる、幸せな1年でしょう。<br><br>
                </p>
                <h3>💻仕事運💻</h3>
                <p>
                新しい業務や技術に挑戦することで、仕事の幅を広げられるでしょう。<br>
                あなたのアイデアが評価され、抜擢や昇進の可能性もありそう。<br>
                前向きな姿勢が周囲にもプラスの影響を与え、人の輪がさらに広がります。<br><br>
                </p>",
    
    "魚座♓︎" => "<h3>⭐️総合運⭐️</h3>
                <p>
                穏やかな気持ちで、マイペースに過ごせる１年です。<br>
                前半はそれまで温めていた物事に着手すると、その後きちんとした形にできるでしょう。<br>
                9月以降は持ち前の直感力がさらにアップ！<br>
                ギアをぐっと上げて、次のステージに駆け上がっていけます。<br>
                年末にはさらに新しい世界へ羽ばたく準備ができていそう。<br>
                それまでの自分を手放し、新たな道を探究することで、<br>
                よりあなたらしく自由に振る舞えるようになるでしょう。<br><br>
                </p>
                <h3>🩷恋愛運🩷</h3>
                <p>
                自然体でいればいるほど、愛が育まれる2024年。<br>
                人に合わせることなく、思うままの行動が恋愛運アップにつながります。<br>
                言葉に出さなくても相手の気持ちが理解でき、穏やかな心の交流に幸せを感じる場面にも恵まれそう。<br><br>
                </p>
                <h3>💻仕事運💻</h3>
                <p>
                穏やかに落ち着いて仕事ができる年です。<br>
                人間関係にも恵まれ、自分のペースで業務を進められるでしょう。<br>
                直感的に思いついたアイデアが採用され、思わぬ注目を浴びる場面も。<br>
                仕事を通して、自分に自信をつけられそうです。<br><br>
                </p>",
);

// 占い結果を表示
echo "<p>{$fortune[$seiza]}</p>";
?>
